import datetime

N = (datetime.datetime.now() - datetime.datetime(2020, 1, 22)).days

ratio2heb = {
        'recovered_confirmed_ratio':'אחוז המחלימים מתוך כלל המקרים המאומתים, כפי שעודכן',
        'deaths_closed_ratio':'אחוז המתים מתוך כלל המקרים הסגורים (מתים ומחלימים), כפי שעודכן',
        'deaths_confirmed_ratio':'לפי חישוב מצטבר, אחוז המתים מתוך כלל המקרים המאומתים',
        'deaths_growth':'הגידול במספר המתים הכולל',
        'confirmed_growth':'הגידול במספר המקרים המאומתים הכולל',
        'recovered_growth':'הגידול במספר המחלימים הכולל',
        'new_confirmed':'מספר המקרים המאומתים שהתגלו',
        'new_deaths':'מספר החולים שנפטרו',
        'new_recovered':'מספר החולים שהחלימו',
        'new_deaths_confirmed_ratio':'אחוז המתים מתוך כלל המקרים המאומתים שהתגלו',
        'new_recovered_confirmed_ratio':'אחוז המחלימים מתוך כלל המקרים המאומתים שהתגלו',
        'new_deaths_closed_ratio':'אחוז המתים מתוך כלל המקרים הסגורים (מתים ומחלימים), שנסגרו',
             }

min_max2heb = {'min':'הנמוך', 'max':'הגבוה'}


k2heb = {
        1:'ביום האחרון',
         2:'ביומיים האחרונים',
         7:'בשבוע האחרון',
 14:'בשבועיים האחרונים',
          21:'בשלושת השבועות האחרונים',
                    28:'בארבעת השבועות האחרונים',
            30:'בחודש האחרון',
  31:'בחודש האחרון',
   60:'בחודשיים האחרונים',
    61:'בחודשיים האחרונים',
      62:'בחודשיים האחרונים',
            }
kdays2heb = {
        3:'בשלושת',
        4:'בארבעת',
        5:'בחמשת',
        6:'בששת',
        8:'בשמונת',
        9:'בתשעת',
        10:'בעשרת',
          20:'בעשרים',
           30:'בשלושים',
              40:'בארבעים',
                 50:'בחמישים',
                    70:'בשבעים',
                              80:'בשמונים',
                                90:'בתשעים',
        }

for num in range(1,N+1):
    if num not in kdays2heb and num not in k2heb:
        kdays2heb[num] = f'ב-{num}'

for k_key, heb_st in kdays2heb.items():
    k2heb[k_key] = f'{heb_st} הימים האחרונים'
    
titles2heb = {'up_news':['התחזקות במגמת השטחת העקומה','מתקרבים לסיום המשבר?','אופטימיות זהירה','מגמת שיפור בהתפשטות המגיפה','בדרך לסיום ההתפרצות?','נתונים חיוביים בנוגע להתפשטות המחלה'],
              'dn_news':['לקראת החרפה נוספת במדיניות הסגר?','הסיום לא נראה באופק','החרפה בהתפרצות הקורונה','נתונים מדאיגים בנוגע להתפשטות המחלה']}

contry2heb = {'Israel':'ישראל'}